In [1]:
import numpy as np
import pandas as pd

In [2]:
a=pd.Series(['a','b','c'])

In [4]:
a.iloc(0)

In [7]:
a.ndim

1

In [9]:
a.sum()

'abc'

In [11]:
a.mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0    a
1    b
2    c
dtype: object>

In [16]:
a[0]:a[2]=[1,2,3]

In [18]:
a[0]

[1, 2, 3]

In [21]:
a[[1,2]]

1    b
2    c
dtype: object

In [23]:
a=pd.DataFrame({
    'population':[1,2,3],
    'GDP':[4,5,6],
})

In [25]:
a.index=['thai','viet','lao']

In [26]:
a

      population  GDP
thai           1    4
viet           2    5
lao            3    6

In [29]:
a.loc['thai']

population    1
GDP           4
Name: thai, dtype: int64

In [37]:
a.iloc[[0,1]]

      population  GDP
thai           1    4
viet           2    5

In [38]:
lang=pd.Series(['thai','viet','lao'], index=['thai','viet','lao'])

In [39]:
a['language']=lang

In [40]:
a

      population  GDP language
thai           1    4     thai
viet           2    5     viet
lao            3    6      lao

In [41]:
a['language']='english'

In [43]:
a['language']=lang

In [44]:
a

      population  GDP language
thai           1    4     thai
viet           2    5     viet
lao            3    6      lao

In [46]:
a.drop(columns='language', inplace= True)

In [47]:
a

      population  GDP
thai           1    4
viet           2    5
lao            3    6

In [48]:
a

      population  GDP
thai           1    4
viet           2    5
lao            3    6

In [61]:
a.iloc[[0,1,-1]]

      population  GDP
thai           1    4
viet           2    5
lao            3    6

In [63]:
a.loc['thai']=[np.nan, np.inf]

In [64]:
a

      population  GDP
thai         NaN  inf
viet         2.0  5.0
lao          3.0  6.0